#include "CcnInteger.h"
int
main ( ) {
	::CcnRun ( );
}
//用一元多项式乘法技术计算两个大的十进制量的乘值;
// 幻化　二个十进制量为 二个 多项式，然后 计算乘
// 67 = 6 *x¹ +  7＊xº
// 99 = 9 *x¹ +  9＊xº
// x=R=10
// 用二组变量 存这量二个量  : 
// A组: 　　A[1] 　存6  A[0] 存7 ;  
// B组: 　　B[1] 　存9  B[0] 9  ;  
// 办得量存入一组C变量里;
// 67*99  变成下面竖式乘
//			   	           B[1]		         B[0]
//					           A[1]		         A[0]  
// ------------------------------------
//					          A[0]×B[1]    A[0]×B[0]
//A[1]×B[1]    A[1]×B[0]
// ------------------------------------------------------------------------
//C[2]             C[1]            C[0]
//
//C [ 2 ] = A [ 1 ] × B [ 1 ];															//R2
//C [ 1 ] = A [ 1 ] × B [ 0 ] + A [ 0 ] × B [ 1 ] ;	//R1
//C [ 0 ] = A [ 0 ] × B [ 0 ];															//R0
//R=100000000

